vmux0.0.13/ycsbVMs_ycsb_64vms_bridge_-1rps_rep1/vm21.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-04-18 14:11:21:271 0 sec: 0 operations; est completion in 0 second 
2025-04-18 14:11:31:073 10 sec: 32989 operations; 3298.9 current ops/sec; est completion in 1 day 12 hours [READ: Count=16647, Max=22191, Min=103, Avg=286.63, 90=472, 99=1171, 99.9=3629, 99.99=10823] [UPDATE: Count=16367, Max=30607, Min=102, Avg=295.6, 90=479, 99=1333, 99.9=4279, 99.99=11919] 
2025-04-18 14:11:41:072 20 sec: 61664 operations; 2867.5 current ops/sec; est completion in 1 day 14 hours [READ: Count=14328, Max=16079, Min=104, Avg=342.62, 90=580, 99=923, 99.9=4167, 99.99=12423] [UPDATE: Count=14322, Max=12871, Min=96, Avg=341.61, 90=587, 99=912, 99.9=3943, 99.99=10231] 
2025-04-18 14:11:51:072 30 sec: 90929 operations; 2926.5 current ops/sec; est completion in 1 day 15 hours [READ: Count=14604, Max=10103, Min=105, Avg=339.07, 90=487, 99=660, 99.9=990, 99.99=4503] [UPDATE: Count=14661, Max=3987, Min=109, Avg=339, 90=489, 99=669, 99.9=993, 99.99=3725] 
2025-04-18 14:12:01:073 40 sec: 116346 operations; 2541.7 current ops/sec; est completion in 1 day 17 hours [READ: Count=12742, Max=6831, Min=125, Avg=389.56, 90=545, 99=825, 99.9=1402, 99.99=2549] [UPDATE: Count=12675, Max=3923, Min=125, Avg=390.82, 90=548, 99=841, 99.9=1401, 99.99=2623] 
2025-04-18 14:12:11:072 50 sec: 150274 operations; 3392.8 current ops/sec; est completion in 1 day 15 hours [READ: Count=17056, Max=25983, Min=104, Avg=292.09, 90=466, 99=643, 99.9=843, 99.99=1973] [UPDATE: Count=16872, Max=3999, Min=97, Avg=292.29, 90=467, 99=660, 99.9=878, 99.99=1767] 
2025-04-18 14:12:21:073 60 sec: 183771 operations; 3349.7 current ops/sec; est completion in 1 day 14 hours [READ: Count=16822, Max=5811, Min=108, Avg=294.9, 90=461, 99=606, 99.9=1232, 99.99=4407] [UPDATE: Count=16675, Max=16351, Min=112, Avg=296.97, 90=464, 99=604, 99.9=915, 99.99=4203] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-04-18 14:12:22:081 61 sec: 187817 operations; 4013.89 current ops/sec; est completion in 1 day 14 hours [READ: Count=2026, Max=9751, Min=122, Avg=245.21, 90=398, 99=486, 99.9=587, 99.99=9751] [CLEANUP: Count=1, Max=1303, Min=1303, Avg=1303, 90=1303, 99=1303, 99.9=1303, 99.99=1303] [UPDATE: Count=2020, Max=4391, Min=122, Avg=244.64, 90=397, 99=517, 99.9=948, 99.99=4391] 
[OVERALL], RunTime(ms), 61014
[OVERALL], Throughput(ops/sec), 3078.2607270462518
[TOTAL_GCS_Copy], Count, 17
[TOTAL_GC_TIME_Copy], Time(ms), 23
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03769626643065526
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 17
[TOTAL_GC_TIME], Time(ms), 23
[TOTAL_GC_TIME_%], Time(%), 0.03769626643065526
[READ], Operations, 94225
[READ], AverageLatency(us), 318.76226054656405
[READ], MinLatency(us), 103
[READ], MaxLatency(us), 25983
[READ], 95thPercentileLatency(us), 566
[READ], 99thPercentileLatency(us), 790
[READ], Return=OK, 94225
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1303.0
[CLEANUP], MinLatency(us), 1303
[CLEANUP], MaxLatency(us), 1303
[CLEANUP], 95thPercentileLatency(us), 1303
[CLEANUP], 99thPercentileLatency(us), 1303
[UPDATE], Operations, 93592
[UPDATE], AverageLatency(us), 320.88255406444995
[UPDATE], MinLatency(us), 96
[UPDATE], MaxLatency(us), 30607
[UPDATE], 95thPercentileLatency(us), 574
[UPDATE], 99thPercentileLatency(us), 811
[UPDATE], Return=OK, 93592
AUTOTEST_DONE